at0m-b0mb/Basanos-ESP32-S3/sdkconfig.defaults
# Basanos — board defaults for the ESP32-S3R8 (16 MB flash, 8 MB OCTAL PSRAM).
CONFIG_IDF_TARGET="esp32s3"

# 8 MB PSRAM on this module is OCTAL, not quad. Getting this wrong boots to a
# blank screen with no error, because the framebuffer allocation silently fails.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Console over the built-in USB-Serial/JTAG, which is why UART0 on 43/44 stays
# free for a companion device.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
